# :heavy_check_mark:Terragrunt Plan
```hcl
Group 1
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample2/hcl/network

Plan: 4 to add, 0 to change, 4 to destroy.
```
<details>
<summary>Details</summary>


```hcl
Group 1
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample2/hcl/network

--------
COMMAND: terragrunt run-all plan  -no-color terragrunt-working-dir=hcl   --terragrunt-non-interactive
WORKSPACE: tc3-cicd
AWS_PROFILE: default
--------
[INFO] Getting version from tgenv-version-name
[INFO] TGENV_VERSION is 0.38.0
aws_vpc.this[0]: Refreshing state... [id=vpc-0f5158fd450c7bc76]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b24134a8880dae5d]
aws_subnet.public[1]: Refreshing state... [id=subnet-063fb96b8b3188a15]
aws_subnet.public[0]: Refreshing state... [id=subnet-081e58a5eb5f109dd]
aws_subnet.public[2]: Refreshing state... [id=subnet-0a534ce8243d46389]
aws_route_table.public[0]: Refreshing state... [id=rtb-0e636c3926b9e6eb6]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e636c3926b9e6eb61080289494]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cb8a24e96c48925e]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0597746f6c753323e]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-080644772c1dfe29a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route_table_association.public[1] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-080644772c1dfe29a" -> (known after apply)
      ~ subnet_id      = "subnet-063fb96b8b3188a15" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public[2] must be replaced
-/+ resource "aws_route_table_association" "public" {
      ~ id             = "rtbassoc-0597746f6c753323e" -> (known after apply)
      ~ subnet_id      = "subnet-0a534ce8243d46389" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:479255487053:subnet/subnet-063fb96b8b3188a15" -> (known after apply)
      ~ availability_zone                              = "us-east-1c" -> "us-east-1b" # forces replacement
      ~ availability_zone_id                           = "use1-az4" -> (known after apply)
      ~ id                                             = "subnet-063fb96b8b3188a15" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "479255487053" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name"        = "tc3-cicd-vpc-public-us-east-1c" -> "tc3-cicd-vpc-public-us-east-1b"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"        = "tc3-cicd-vpc-public-us-east-1c" -> "tc3-cicd-vpc-public-us-east-1b"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # aws_subnet.public[2] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:479255487053:subnet/subnet-0a534ce8243d46389" -> (known after apply)
      ~ availability_zone                              = "us-east-1d" -> "us-east-1c" # forces replacement
      ~ availability_zone_id                           = "use1-az6" -> (known after apply)
      ~ id                                             = "subnet-0a534ce8243d46389" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "479255487053" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name"        = "tc3-cicd-vpc-public-us-east-1d" -> "tc3-cicd-vpc-public-us-east-1c"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"        = "tc3-cicd-vpc-public-us-east-1d" -> "tc3-cicd-vpc-public-us-east-1c"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ azs                                = [
        "us-east-1a",
      + "us-east-1b",
        "us-east-1c",
      - "us-east-1d",
    ]
  ~ public_route_table_association_ids = [
        "rtbassoc-0cb8a24e96c48925e",
      - "rtbassoc-080644772c1dfe29a",
      - "rtbassoc-0597746f6c753323e",
      + (known after apply),
      + (known after apply),
    ]
  ~ public_subnet_arns                 = [
        "arn:aws:ec2:us-east-1:479255487053:subnet/subnet-081e58a5eb5f109dd",
      - "arn:aws:ec2:us-east-1:479255487053:subnet/subnet-063fb96b8b3188a15",
      - "arn:aws:ec2:us-east-1:479255487053:subnet/subnet-0a534ce8243d46389",
      + (known after apply),
      + (known after apply),
    ]
  ~ public_subnets                     = [
        "subnet-081e58a5eb5f109dd",
      - "subnet-063fb96b8b3188a15",
      - "subnet-0a534ce8243d46389",
      + (known after apply),
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
<!-- plan -->